Tekla.Structures.Drawing.PourObject.PourAttributes
The PourAttributes class is the attributes class for the pour.

Tekla.Structures.Drawing.PourObject.PourAttributes.DrawHiddenLines
True if hidden lines are drawn.

Tekla.Structures.Drawing.PourObject.PourAttributes.DrawOwnHiddenLines
True if own hidden lines are drawn.

Tekla.Structures.Drawing.PourObject.PourAttributes.DrawChamfers
True if chamfers are drawn.

Tekla.Structures.Drawing.PourObject.PourAttributes.VisibleLines
The line type of visible lines.

Tekla.Structures.Drawing.PourObject.PourAttributes.SectionLines
The line type of section lines.

Tekla.Structures.Drawing.PourObject.PourAttributes.HiddenLines
The line type of hidden lines.

Tekla.Structures.Drawing.PourObject.PourAttributes.OwnHiddenLines
The line type of own hidden lines.

Tekla.Structures.Drawing.PourObject.PourAttributes.FaceHatch
The hatch type of the face hatch.

Tekla.Structures.Drawing.PourObject.PourAttributes.SectionFaceHatch
The hatch type of the section face hatch.

Tekla.Structures.Drawing.PourObject.PourAttributes.#ctor(System.Boolean)
Creates a new default pour attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.PourObject.PourAttributes.#ctor
Creates a new default pour attributes instance that loads standard attributes.

Tekla.Structures.Drawing.PourObject.PourAttributes.#ctor(System.String)
Creates a new pour attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.PourObject.PourAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.PourObject.PourAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.